data/pressure_sweep/cases/25e-6/icofoam_25e-6/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "598";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4800
(
(0.000461278 1.64593e-07 -3.56134e-26)
(0.00045368 2.27136e-07 -2.50241e-25)
(0.000449047 2.70043e-07 3.20866e-25)
(0.000446395 2.93263e-07 1.46383e-25)
(0.000445218 3.00573e-07 2.15883e-24)
(0.000445178 2.91485e-07 -5.13414e-24)
(0.000446095 2.63403e-07 4.78627e-24)
(0.000447908 2.10756e-07 -6.90788e-24)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    Walls
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
