data/pressure_sweep/cases/25e-6/icofoam_25e-6/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "598";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
4800
(
2.94584e-13
-1.40716e-06
-2.58103e-06
-3.57167e-06
-4.4202e-06
-5.15475e-06
-5.79642e-06
-6.36182e-06
...
)
;

boundaryField
{
    inlet
    {
        type            uniformJump;
        patchType       cyclic;
        jumpTable       table ((0 -25e-6) (25 -25e-6) (25.5 -1e-4) (26 -25e-6));
        value           nonuniform List<scalar> 
40
(
7.89537e-07
8.0115e-07
8.15594e-07
8.30887e-07
8.47678e-07
8.67345e-07
8.92061e-07
9.25398e-07
...
)
;
    }
    outlet
    {
        type            uniformJump;
        patchType       cyclic;
        value           nonuniform List<scalar> 
40
(
-2.42105e-05
-2.41989e-05
-2.41844e-05
-2.41691e-05
-2.41523e-05
-2.41327e-05
-2.41079e-05
-2.40746e-05
...
)
;
    }
    Walls
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
