data/pressure_sweep/cases/25e-6/icofoam_25e-6/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
